sections_id = []

class Device(object):
    def __init__(self, type_device, address):
        self.type = type_device
        self.address = address
        self.description = ''
        self.sections = []

    def add_address(self, address):
        self.address = address

    def add_description(self, description):
        self.description = description

    def add_section(self, num: int, description: str):
        if self.check_section(num):
            self.sections.append([f'Раздел: {str(num)}', f'Описание: "{description}"'])
            return True
        else:
            return False

    def get_header(self):
        return f'Адрес: {self.address},  Тип_прибора: {self.type},   Описание: "{self.description}"'

    def check_section(self, section: int):
        global sections_id
        if section not in sections_id:
            sections_id.append(section)
            return True
        else:
            return False

    def read_plume(self, num):
        return self.plumes[num]

    def write_plume(self, num: int, chapter: int = 0, description: str = ''):
        if self.plumes.get(num):
            self.plumes[num][1] = f'Раздел: {str(chapter)}' if chapter > 0 else self.plumes[num - 1][1]
            self.plumes[num][2] = f'Описание: "{description}"' if description != '' else self.plumes[num - 1][2]

    def read_relay(self, num):
        return self.relay[num]

    def write_relay(self, num: int,  description: str, *chapters: int):
        if self.relay.get(num):
            for c in chapters:
                self.relay[num][5].append(f'Раздел: {str(c)}')
            self.output[num][1] = f'Описание: "{description}"'


class C2000(object):
    def __init__(self, version: str):
        # head
        self.begin = 'Конфигурация пульта С2000'
        self.version = f'Версия: {version}'
        self.support_devices = [
            [34, 'Тип_прибора: 34, Число_шлейфов: 110, Число_реле: 4,    Базовый_тип:стандартный, Название: "Сигнал-10"']]
        self.chapters = ['[Версия пульта C2000]',
                         '[Типы_приборов]',
                         '[Пульт]',
                         '[Приборы]',
                         '[Уровни]',
                         '[Пароли]',
                         '[Разделы]',
                         '[Группы разделов]',
                         '[Временные зоны]',
                         '[Передача событий]',
                         '[Привязка управления]',
                         '[Сценарии переименования событий]']
        # work zone
        self.devices = []
        self.passwords = []
        self.sections = []
        self.addresses = []

    def insert(self, device: Device):
        self.addresses.append(f'Адрес: {device.address}')
        self.devices.append(device)

    def update(self):
        for s in sections_id:
            self.sections.append(f'Раздел: {str(s)}')

    def build(self):
        self.update()

        configuration = self.begin
        configuration += '\n\n'
        configuration += self.chapters[0]  # [Версия пульта C2000]
        configuration += '\n\n'
        configuration += self.version
        configuration += '\n\n'
        configuration += self.chapters[1]  # [Типы_приборов]
        configuration += '\n\n'
        configuration += AnyDefVal.type_devices()
        configuration += '\n\n'
        configuration += self.chapters[2]  # [Пульт]
        configuration += '\n\n'
        configuration += self.chapters[3]  # [Приборы]
        configuration += '\n\n'

        # add devices
        for dev in self.devices:
            configuration += dev.build()
            configuration += '\n'

        configuration += '\n\n'
        configuration += self.chapters[4]  # [Уровни]

        # not support

        configuration += '\n\n'
        configuration += self.chapters[5]  # [Пароли]
        configuration += '\n\n'

        # add passwords
        configuration += "\n".join(self.passwords) if self.passwords != [] else AnyDefVal.passwords()

        configuration += '\n\n'
        configuration += self.chapters[6]  # [Разделы]
        configuration += '\n\n'

        # add sections
        configuration += "\n".join(self.sections) if self.sections != [] else ''

        configuration += '\n\n'
        configuration += self.chapters[7]  # [Группы разделов]

        # not support

        configuration += '\n\n'
        configuration += self.chapters[8]  # [Временные зоны]
        configuration += '\n\n'
        configuration += self.chapters[9]  # [Передача событий]
        configuration += '\n\n'
        configuration += self.chapters[10]  # [Привязка управления]

        # not support

        configuration += '\n\n'
        configuration += self.chapters[11]  # [Сценарии переименования событий]

        return configuration


class Kdl(Device):
    def __init__(self, address):
        Device.__init__(self, 34, address)
        self.status = f'Состояние прибора с адресом: {address}'
        self.reader = 'Считыватель: 1'
        self.plumes = {1: ['Шлейф: 1', '', 'Описание: ""'],
                        2: ['Шлейф: 2', '', 'Описание: ""'],
                        3: ['Шлейф: 3', '', 'Описание: ""'],
                        4: ['Шлейф: 4', '', 'Описание: ""'],
                        5: ['Шлейф: 5', '', 'Описание: ""'],
                        6: ['Шлейф: 6', '', 'Описание: ""'],
                        7: ['Шлейф: 7', '', 'Описание: ""'],
                        8: ['Шлейф: 8', '', 'Описание: ""'],
                        9: ['Шлейф: 9', '', 'Описание: ""'],
                        10: ['Шлейф: 10', '', 'Описание: ""'],
                        11: ['Шлейф: 11', '', 'Описание: ""'],
                        12: ['Шлейф: 12', '', 'Описание: ""'],
                        13: ['Шлейф: 13', '', 'Описание: ""'],
                        14: ['Шлейф: 14', '', 'Описание: ""'],
                        15: ['Шлейф: 15', '', 'Описание: ""'],
                        16: ['Шлейф: 16', '', 'Описание: ""'],
                        17: ['Шлейф: 17', '', 'Описание: ""'],
                        18: ['Шлейф: 18', '', 'Описание: ""'],
                        19: ['Шлейф: 19', '', 'Описание: ""'],
                        20: ['Шлейф: 20', '', 'Описание: ""'],
                        21: ['Шлейф: 21', '', 'Описание: ""'],
                        22: ['Шлейф: 22', '', 'Описание: ""'],
                        23: ['Шлейф: 23', '', 'Описание: ""'],
                        24: ['Шлейф: 24', '', 'Описание: ""'],
                        25: ['Шлейф: 25', '', 'Описание: ""'],
                        26: ['Шлейф: 26', '', 'Описание: ""'],
                        27: ['Шлейф: 27', '', 'Описание: ""'],
                        28: ['Шлейф: 28', '', 'Описание: ""'],
                        29: ['Шлейф: 29', '', 'Описание: ""'],
                        30: ['Шлейф: 30', '', 'Описание: ""'],
                        31: ['Шлейф: 31', '', 'Описание: ""'],
                        32: ['Шлейф: 32', '', 'Описание: ""'],
                        33: ['Шлейф: 33', '', 'Описание: ""'],
                        34: ['Шлейф: 34', '', 'Описание: ""'],
                        35: ['Шлейф: 35', '', 'Описание: ""'],
                        36: ['Шлейф: 36', '', 'Описание: ""'],
                        37: ['Шлейф: 37', '', 'Описание: ""'],
                        38: ['Шлейф: 38', '', 'Описание: ""'],
                        39: ['Шлейф: 39', '', 'Описание: ""'],
                        40: ['Шлейф: 40', '', 'Описание: ""'],
                        41: ['Шлейф: 41', '', 'Описание: ""'],
                        42: ['Шлейф: 42', '', 'Описание: ""'],
                        43: ['Шлейф: 43', '', 'Описание: ""'],
                        44: ['Шлейф: 44', '', 'Описание: ""'],
                        45: ['Шлейф: 45', '', 'Описание: ""'],
                        46: ['Шлейф: 46', '', 'Описание: ""'],
                        47: ['Шлейф: 47', '', 'Описание: ""'],
                        48: ['Шлейф: 48', '', 'Описание: ""'],
                        49: ['Шлейф: 49', '', 'Описание: ""'],
                        50: ['Шлейф: 50', '', 'Описание: ""'],
                        51: ['Шлейф: 51', '', 'Описание: ""'],
                        52: ['Шлейф: 52', '', 'Описание: ""'],
                        53: ['Шлейф: 53', '', 'Описание: ""'],
                        54: ['Шлейф: 54', '', 'Описание: ""'],
                        55: ['Шлейф: 55', '', 'Описание: ""'],
                        56: ['Шлейф: 56', '', 'Описание: ""'],
                        57: ['Шлейф: 57', '', 'Описание: ""'],
                        58: ['Шлейф: 58', '', 'Описание: ""'],
                        59: ['Шлейф: 59', '', 'Описание: ""'],
                        60: ['Шлейф: 60', '', 'Описание: ""'],
                        61: ['Шлейф: 61', '', 'Описание: ""'],
                        62: ['Шлейф: 62', '', 'Описание: ""'],
                        63: ['Шлейф: 63', '', 'Описание: ""'],
                        64: ['Шлейф: 64', '', 'Описание: ""'],
                        65: ['Шлейф: 65', '', 'Описание: ""'],
                        66: ['Шлейф: 66', '', 'Описание: ""'],
                        67: ['Шлейф: 67', '', 'Описание: ""'],
                        68: ['Шлейф: 68', '', 'Описание: ""'],
                        69: ['Шлейф: 69', '', 'Описание: ""'],
                        70: ['Шлейф: 70', '', 'Описание: ""'],
                        71: ['Шлейф: 71', '', 'Описание: ""'],
                        72: ['Шлейф: 72', '', 'Описание: ""'],
                        73: ['Шлейф: 73', '', 'Описание: ""'],
                        74: ['Шлейф: 74', '', 'Описание: ""'],
                        75: ['Шлейф: 75', '', 'Описание: ""'],
                        76: ['Шлейф: 76', '', 'Описание: ""'],
                        77: ['Шлейф: 77', '', 'Описание: ""'],
                        78: ['Шлейф: 78', '', 'Описание: ""'],
                        79: ['Шлейф: 79', '', 'Описание: ""'],
                        80: ['Шлейф: 80', '', 'Описание: ""'],
                        81: ['Шлейф: 81', '', 'Описание: ""'],
                        82: ['Шлейф: 82', '', 'Описание: ""'],
                        83: ['Шлейф: 83', '', 'Описание: ""'],
                        84: ['Шлейф: 84', '', 'Описание: ""'],
                        85: ['Шлейф: 85', '', 'Описание: ""'],
                        86: ['Шлейф: 86', '', 'Описание: ""'],
                        87: ['Шлейф: 87', '', 'Описание: ""'],
                        88: ['Шлейф: 88', '', 'Описание: ""'],
                        89: ['Шлейф: 89', '', 'Описание: ""'],
                        90: ['Шлейф: 90', '', 'Описание: ""'],
                        91: ['Шлейф: 91', '', 'Описание: ""'],
                        92: ['Шлейф: 92', '', 'Описание: ""'],
                        93: ['Шлейф: 93', '', 'Описание: ""'],
                        94: ['Шлейф: 94', '', 'Описание: ""'],
                        95: ['Шлейф: 95', '', 'Описание: ""'],
                        96: ['Шлейф: 96', '', 'Описание: ""'],
                        97: ['Шлейф: 97', '', 'Описание: ""'],
                        98: ['Шлейф: 98', '', 'Описание: ""'],
                        99: ['Шлейф: 99', '', 'Описание: ""'],
                        100: ['Шлейф: 100', '', 'Описание: ""'],
                        101: ['Шлейф: 101', '', 'Описание: ""'],
                        102: ['Шлейф: 102', '', 'Описание: ""'],
                        103: ['Шлейф: 103', '', 'Описание: ""'],
                        104: ['Шлейф: 104', '', 'Описание: ""'],
                        105: ['Шлейф: 105', '', 'Описание: ""'],
                        106: ['Шлейф: 106', '', 'Описание: ""'],
                        107: ['Шлейф: 107', '', 'Описание: ""'],
                        108: ['Шлейф: 108', '', 'Описание: ""'],
                        109: ['Шлейф: 109', '', 'Описание: ""'],
                        110: ['Шлейф: 110', '', 'Описание: ""'],
                        111: ['Шлейф: 111', '', 'Описание: ""'],
                        112: ['Шлейф: 112', '', 'Описание: ""'],
                        113: ['Шлейф: 113', '', 'Описание: ""'],
                        114: ['Шлейф: 114', '', 'Описание: ""'],
                        115: ['Шлейф: 115', '', 'Описание: ""'],
                        116: ['Шлейф: 116', '', 'Описание: ""'],
                        117: ['Шлейф: 117', '', 'Описание: ""'],
                        118: ['Шлейф: 118', '', 'Описание: ""'],
                        119: ['Шлейф: 119', '', 'Описание: ""'],
                        120: ['Шлейф: 120', '', 'Описание: ""'],
                        121: ['Шлейф: 121', '', 'Описание: ""'],
                        122: ['Шлейф: 122', '', 'Описание: ""'],
                        123: ['Шлейф: 123', '', 'Описание: ""'],
                        124: ['Шлейф: 124', '', 'Описание: ""'],
                        125: ['Шлейф: 125', '', 'Описание: ""'],
                        126: ['Шлейф: 126', '', 'Описание: ""'],
                        127: ['Шлейф: 127', '', 'Описание: ""']}
        self.output = {}
        self.relay = {}

    def plumes_to_relay(self, num):
        if self.plumes.get(num):
            self.plumes.pop(num)
            self.relay[num] = ['Реле: ' + str(num), '', '', '', '', []]

    def plumes_to_output(self, num):
        if self.plumes.get(num):
            self.plumes.pop(num)
            self.output[num] = ['Выход: ' + str(num), '']

    def relay_to_plumes(self, num):
        if self.relay.get(num):
            self.relay.pop(num)
            self.plumes[num] = ['Шлейф: ' + str(num), '', 'Описание: ""']

    def output_to_plumes(self, num):
        if self.output.get(num):
            self.output.pop(num)
            self.plumes[num] = ['Шлейф: ' + str(num), '', 'Описание: ""']

    def build(self):
        head = "\n  ".join([self.get_header(),
                            self.status,
                            self.reader])
        plumes = ''
        for p in [val for key, val in sorted(self.plumes.items(), key=lambda ele: ele[0])]:
            p = list(filter(None, p))
            plumes += "  " + ", ".join(p)
            plumes += "\n"
        for o in [val for key, val in sorted(self.output.items(), key=lambda ele: ele[0])]:
            o = list(filter(None, o))
            plumes += "  " + ", ".join(o)
            plumes += "\n"
        for r in [val for key, val in sorted(self.relay.items(), key=lambda ele: ele[0])]:
            chs = ''
            for ch in r[5]:
                chs += f'    {ch}\n' if ch != '' else ''

            relay = list(filter(None, r[:-1]))

            plumes += f"  {', '.join(relay)}\n{chs[:-1]}" if chs != '' else f"  {', '.join(relay)}"
            plumes += "\n"

        plumes = plumes[:-1]

        return "\n".join([head, plumes])


class AnyDefVal:
    @staticmethod
    def type_devices():
        return 'Тип_прибора: 1,  Число_шлейфов: 20,  Число_реле: 0,    Базовый_тип:стандартный, Название: "Сигнал-20"\n' \
            'Тип_прибора: 2,  Число_шлейфов: 20,  Число_реле: 5,    Базовый_тип:стандартный, Название: "Сигнал-20П"\n' \
            'Тип_прибора: 3,  Число_шлейфов: 0,   Число_реле: 4,    Базовый_тип:стандартный, Название: "С2000-СП1"\n' \
            'Тип_прибора: 4,  Число_шлейфов: 4,   Число_реле: 2,    Базовый_тип:стандартный, Название: "С2000-4"\n' \
            'Тип_прибора: 7,  Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-К"\n' \
            'Тип_прибора: 8,  Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-ИТ"\n' \
            'Тип_прибора: 9,  Число_шлейфов: 127, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КДЛ"\n' \
            'Тип_прибора: 10, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-БИ/БКИ"\n' \
            'Тип_прибора: 11, Число_шлейфов: 20,  Число_реле: 5,    Базовый_тип:стандартный, Название: "Сигнал-20(вер. 02)"\n' \
            'Тип_прибора: 13, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КС"\n' \
            'Тип_прибора: 14, Число_шлейфов: 6,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-АСПТ"\n' \
            'Тип_прибора: 15, Число_шлейфов: 2,   Число_реле: 6,    Базовый_тип:стандартный, Название: "С2000-КПБ"\n' \
            'Тип_прибора: 16, Число_шлейфов: 2,   Число_реле: 2,    Базовый_тип:стандартный, Название: "С2000-2"\n' \
            'Тип_прибора: 19, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "УО-ОРИОН"\n' \
            'Тип_прибора: 20, Число_шлейфов: 4,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор"\n' \
            'Тип_прибора: 21, Число_шлейфов: 26,  Число_реле: 0,    Базовый_тип:стандартный, Название: "Рупор-Диспетчер исп.01"\n' \
            'Тип_прибора: 22, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-ПТ"\n' \
            'Тип_прибора: 24, Число_шлейфов: 4,   Число_реле: 0,    Базовый_тип:стандартный, Название: "УО-4С"\n' \
            'Тип_прибора: 25, Число_шлейфов: 47,  Число_реле: 0,    Базовый_тип:стандартный, Название: "Поток-3Н"\n' \
            'Тип_прибора: 26, Число_шлейфов: 20,  Число_реле: 5,    Базовый_тип:стандартный, Название: "Сигнал-20М"\n' \
            'Тип_прибора: 28, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-БИ-01"\n' \
            'Тип_прибора: 30, Число_шлейфов: 0,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор-01"\n' \
            'Тип_прибора: 31, Число_шлейфов: 134, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-Adem"\n' \
            'Тип_прибора: 33, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-12 исп.50, исп.51, без исполнения"\n' \
            'Тип_прибора: 34, Число_шлейфов: 110, Число_реле: 4,    Базовый_тип:стандартный, Название: "Сигнал-10"\n' \
            'Тип_прибора: 36, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-ПП"\n' \
            'Тип_прибора: 38, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-12 исп.54"\n' \
            'Тип_прибора: 39, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-24 исп.50, исп.51"\n' \
            'Тип_прибора: 41, Число_шлейфов: 127, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КДЛ-2И"\n' \
            'Тип_прибора: 43, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-PGE"\n' \
            'Тип_прибора: 44, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-БКИ"\n' \
            'Тип_прибора: 45, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "Поток-БКИ"\n' \
            'Тип_прибора: 46, Число_шлейфов: 3,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор-200"\n' \
            'Тип_прибора: 47, Число_шлейфов: 200, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-Периметр"\n' \
            'Тип_прибора: 48, Число_шлейфов: 6,   Число_реле: 0,    Базовый_тип:стандартный, Название: "МИП-12"\n' \
            'Тип_прибора: 49, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "МИП-24"\n' \
            'Тип_прибора: 53, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-48 исп.01"\n' \
            'Тип_прибора: 54, Число_шлейфов: 6,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-12 исп.56"\n' \
            'Тип_прибора: 55, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-24 исп.56"\n' \
            'Тип_прибора: 59, Число_шлейфов: 2,   Число_реле: 4,    Базовый_тип:стандартный, Название: "Рупор исп.02"\n' \
            'Тип_прибора: 61, Число_шлейфов: 127, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КДЛ-Modbus"\n' \
            'Тип_прибора: 66, Число_шлейфов: 5,   Число_реле: 5,    Базовый_тип:стандартный, Название: "Рупор исп.03"\n' \
            'Тип_прибора: 67, Число_шлейфов: 7,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор-300"\n' \
            'Тип_прибора: 76, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-PGE исп.01"\n'

    @staticmethod
    def passwords():
        return 'Номер: 1,   Тип_пароля: "Пароль"  , Пароль: 123456   , Хозорган: "Программирование"\n' \
               'Номер: 2,   Тип_пароля: "Пароль"  , Пароль: 1234     , Хозорган: "Управление шлейфами", Уровень: 255\n'
