sections_id = []

class Device(object):
    def __init__(self, type_device, address):
        self.type = type_device
        self.address = address
        self.description = ''
        self.sections = []

    def add_address(self, address):
        self.address = address

    def add_description(self, description):
        self.description = description

    def add_section(self, num: int, description: str):
        if self.check_section(num):
            self.sections.append([f'Раздел: {str(num)}', f'Описание: "{description}"'])
            return True
        else:
            return False

    def get_header(self):
        return f'Адрес: {self.address},  Тип_прибора: {self.type},   Описание: "{self.description}"'

    def check_section(self, section: int):
        global sections_id
        if section not in sections_id:
            sections_id.append(section)
            return True
        else:
            return False


class C2000(object):
    def __init__(self, version: str):
        # head
        self.begin = 'Конфигурация пульта С2000'
        self.version = f'Версия: {version}'
        self.support_devices = [
            [34, 'Тип_прибора: 34, Число_шлейфов: 110, Число_реле: 4,    Базовый_тип:стандартный, Название: "Сигнал-10"']]
        self.chapters = ['[Версия пульта C2000]',
                         '[Типы_приборов]',
                         '[Пульт]',
                         '[Приборы]',
                         '[Уровни]',
                         '[Пароли]',
                         '[Разделы]',
                         '[Группы разделов]',
                         '[Временные зоны]',
                         '[Передача событий]',
                         '[Привязка управления]',
                         '[Сценарии переименования событий]']
        # work zone
        self.devices = []
        self.passwords = []
        self.sections = []
        self.addresses = []

    def insert(self, device: Device):
        self.addresses.append(f'Адрес: {device.address}')
        self.devices.append(device)

    def update(self):
        for s in sections_id:
            self.sections.append(f'Раздел: {str(s)}')

    def build(self):
        self.update()

        configuration = self.begin
        configuration += '\n\n'
        configuration += self.chapters[0]  # [Версия пульта C2000]
        configuration += '\n\n'
        configuration += self.version
        configuration += '\n\n'
        configuration += self.chapters[1]  # [Типы_приборов]
        configuration += '\n\n'
        configuration += AnyDefVal.type_devices()
        configuration += '\n\n'
        configuration += self.chapters[2]  # [Пульт]
        configuration += '\n\n'
        configuration += self.chapters[3]  # [Приборы]
        configuration += '\n\n'

        # add devices
        for dev in self.devices:
            configuration += dev.build()
            configuration += '\n'

        configuration += '\n\n'
        configuration += self.chapters[4]  # [Уровни]

        # not support

        configuration += '\n\n'
        configuration += self.chapters[5]  # [Пароли]
        configuration += '\n\n'

        # add passwords
        configuration += "\n".join(self.passwords) if self.passwords != [] else AnyDefVal.passwords()

        configuration += '\n\n'
        configuration += self.chapters[6]  # [Разделы]
        configuration += '\n\n'

        # add sections
        configuration += "\n".join(self.sections) if self.sections != [] else ''

        configuration += '\n\n'
        configuration += self.chapters[7]  # [Группы разделов]

        # not support

        configuration += '\n\n'
        configuration += self.chapters[8]  # [Временные зоны]
        configuration += '\n\n'
        configuration += self.chapters[9]  # [Передача событий]
        configuration += '\n\n'
        configuration += self.chapters[10]  # [Привязка управления]

        # not support

        configuration += '\n\n'
        configuration += self.chapters[11]  # [Сценарии переименования событий]

        return configuration


class Sig10(Device):
    def __init__(self, address):
        Device.__init__(self, 34, address)
        self.status = f'Состояние прибора с адресом: {address}'
        self.reader = 'Считыватель: 1'
        self.plumes = [['Шлейф: 1', '', 'Описание: ""'],
                       ['Шлейф: 2', '', 'Описание: ""'],
                       ['Шлейф: 3', '', 'Описание: ""'],
                       ['Шлейф: 4', '', 'Описание: ""'],
                       ['Шлейф: 5', '', 'Описание: ""'],
                       ['Шлейф: 6', '', 'Описание: ""'],
                       ['Шлейф: 7', '', 'Описание: ""'],
                       ['Шлейф: 8', '', 'Описание: ""'],
                       ['Шлейф: 9', '', 'Описание: ""'],
                       ['Шлейф: 10', '', 'Описание: ""']]
        self.special_plumes = [['Шлейф: 20', '', 'Описание: "шс. 1 изв. 1"'],
                               ['Шлейф: 21', '', 'Описание: "шс. 1 изв. 2"'],
                               ['Шлейф: 22', '', 'Описание: "шс. 1 изв. 3"'],
                               ['Шлейф: 23', '', 'Описание: "шс. 1 изв. 4"'],
                               ['Шлейф: 24', '', 'Описание: "шс. 1 изв. 5"'],
                               ['Шлейф: 25', '', 'Описание: "шс. 1 изв. 6"'],
                               ['Шлейф: 26', '', 'Описание: "шс. 1 изв. 7"'],
                               ['Шлейф: 27', '', 'Описание: "шс. 1 изв. 8"'],
                               ['Шлейф: 28', '', 'Описание: "шс. 1 изв. 9"'],
                               ['Шлейф: 29', '', 'Описание: "шс. 1 изв. 10"'],
                               ['Шлейф: 30', '', 'Описание: "шс. 2 изв. 1"'],
                               ['Шлейф: 31', '', 'Описание: "шс. 2 изв. 2"'],
                               ['Шлейф: 32', '', 'Описание: "шс. 2 изв. 3"'],
                               ['Шлейф: 33', '', 'Описание: "шс. 2 изв. 4"'],
                               ['Шлейф: 34', '', 'Описание: "шс. 2 изв. 5"'],
                               ['Шлейф: 35', '', 'Описание: "шс. 2 изв. 6"'],
                               ['Шлейф: 36', '', 'Описание: "шс. 2 изв. 7"'],
                               ['Шлейф: 37', '', 'Описание: "шс. 2 изв. 8"'],
                               ['Шлейф: 38', '', 'Описание: "шс. 2 изв. 9"'],
                               ['Шлейф: 39', '', 'Описание: "шс. 2 изв. 10"'],
                               ['Шлейф: 40', '', 'Описание: "шс. 3 изв. 1"'],
                               ['Шлейф: 41', '', 'Описание: "шс. 3 изв. 2"'],
                               ['Шлейф: 42', '', 'Описание: "шс. 3 изв. 3"'],
                               ['Шлейф: 43', '', 'Описание: "шс. 3 изв. 4"'],
                               ['Шлейф: 44', '', 'Описание: "шс. 3 изв. 5"'],
                               ['Шлейф: 45', '', 'Описание: "шс. 3 изв. 6"'],
                               ['Шлейф: 46', '', 'Описание: "шс. 3 изв. 7"'],
                               ['Шлейф: 47', '', 'Описание: "шс. 3 изв. 8"'],
                               ['Шлейф: 48', '', 'Описание: "шс. 3 изв. 9"'],
                               ['Шлейф: 49', '', 'Описание: "шс. 3 изв. 10"'],
                               ['Шлейф: 50', '', 'Описание: "шс. 4 изв. 1"'],
                               ['Шлейф: 51', '', 'Описание: "шс. 4 изв. 2"'],
                               ['Шлейф: 52', '', 'Описание: "шс. 4 изв. 3"'],
                               ['Шлейф: 53', '', 'Описание: "шс. 4 изв. 4"'],
                               ['Шлейф: 54', '', 'Описание: "шс. 4 изв. 5"'],
                               ['Шлейф: 55', '', 'Описание: "шс. 4 изв. 6"'],
                               ['Шлейф: 56', '', 'Описание: "шс. 4 изв. 7"'],
                               ['Шлейф: 57', '', 'Описание: "шс. 4 изв. 8"'],
                               ['Шлейф: 58', '', 'Описание: "шс. 4 изв. 9"'],
                               ['Шлейф: 59', '', 'Описание: "шс. 4 изв. 10"'],
                               ['Шлейф: 60', '', 'Описание: "шс. 5 изв. 1"'],
                               ['Шлейф: 61', '', 'Описание: "шс. 5 изв. 2"'],
                               ['Шлейф: 62', '', 'Описание: "шс. 5 изв. 3"'],
                               ['Шлейф: 63', '', 'Описание: "шс. 5 изв. 4"'],
                               ['Шлейф: 64', '', 'Описание: "шс. 5 изв. 5"'],
                               ['Шлейф: 65', '', 'Описание: "шс. 5 изв. 6"'],
                               ['Шлейф: 66', '', 'Описание: "шс. 5 изв. 7"'],
                               ['Шлейф: 67', '', 'Описание: "шс. 5 изв. 8"'],
                               ['Шлейф: 68', '', 'Описание: "шс. 5 изв. 9"'],
                               ['Шлейф: 69', '', 'Описание: "шс. 5 изв. 10"'],
                               ['Шлейф: 70', '', 'Описание: "шс. 6 изв. 1"'],
                               ['Шлейф: 71', '', 'Описание: "шс. 6 изв. 2"'],
                               ['Шлейф: 72', '', 'Описание: "шс. 6 изв. 3"'],
                               ['Шлейф: 73', '', 'Описание: "шс. 6 изв. 4"'],
                               ['Шлейф: 74', '', 'Описание: "шс. 6 изв. 5"'],
                               ['Шлейф: 75', '', 'Описание: "шс. 6 изв. 6"'],
                               ['Шлейф: 76', '', 'Описание: "шс. 6 изв. 7"'],
                               ['Шлейф: 77', '', 'Описание: "шс. 6 изв. 8"'],
                               ['Шлейф: 78', '', 'Описание: "шс. 6 изв. 9"'],
                               ['Шлейф: 79', '', 'Описание: "шс. 6 изв. 10"'],
                               ['Шлейф: 80', '', 'Описание: "шс. 7 изв. 1"'],
                               ['Шлейф: 81', '', 'Описание: "шс. 7 изв. 2"'],
                               ['Шлейф: 82', '', 'Описание: "шс. 7 изв. 3"'],
                               ['Шлейф: 83', '', 'Описание: "шс. 7 изв. 4"'],
                               ['Шлейф: 84', '', 'Описание: "шс. 7 изв. 5"'],
                               ['Шлейф: 85', '', 'Описание: "шс. 7 изв. 6"'],
                               ['Шлейф: 86', '', 'Описание: "шс. 7 изв. 7"'],
                               ['Шлейф: 87', '', 'Описание: "шс. 7 изв. 8"'],
                               ['Шлейф: 88', '', 'Описание: "шс. 7 изв. 9"'],
                               ['Шлейф: 89', '', 'Описание: "шс. 7 изв. 10"'],
                               ['Шлейф: 90', '', 'Описание: "шс. 8 изв. 1"'],
                               ['Шлейф: 91', '', 'Описание: "шс. 8 изв. 2"'],
                               ['Шлейф: 92', '', 'Описание: "шс. 8 изв. 3"'],
                               ['Шлейф: 93', '', 'Описание: "шс. 8 изв. 4"'],
                               ['Шлейф: 94', '', 'Описание: "шс. 8 изв. 5"'],
                               ['Шлейф: 95', '', 'Описание: "шс. 8 изв. 6"'],
                               ['Шлейф: 96', '', 'Описание: "шс. 8 изв. 7"'],
                               ['Шлейф: 97', '', 'Описание: "шс. 8 изв. 8"'],
                               ['Шлейф: 98', '', 'Описание: "шс. 8 изв. 9"'],
                               ['Шлейф: 99', '', 'Описание: "шс. 8 изв. 10"'],
                               ['Шлейф: 100', '', 'Описание: "шс. 9 изв. 1"'],
                               ['Шлейф: 101', '', 'Описание: "шс. 9 изв. 2"'],
                               ['Шлейф: 102', '', 'Описание: "шс. 9 изв. 3"'],
                               ['Шлейф: 103', '', 'Описание: "шс. 9 изв. 4"'],
                               ['Шлейф: 104', '', 'Описание: "шс. 9 изв. 5"'],
                               ['Шлейф: 105', '', 'Описание: "шс. 9 изв. 6"'],
                               ['Шлейф: 106', '', 'Описание: "шс. 9 изв. 7"'],
                               ['Шлейф: 107', '', 'Описание: "шс. 9 изв. 8"'],
                               ['Шлейф: 108', '', 'Описание: "шс. 9 изв. 9"'],
                               ['Шлейф: 109', '', 'Описание: "шс. 9 изв. 10"'],
                               ['Шлейф: 110', '', 'Описание: "шс. 10 изв. 1"'],
                               ['Шлейф: 111', '', 'Описание: "шс. 10 изв. 2"'],
                               ['Шлейф: 112', '', 'Описание: "шс. 10 изв. 3"'],
                               ['Шлейф: 113', '', 'Описание: "шс. 10 изв. 4"'],
                               ['Шлейф: 114', '', 'Описание: "шс. 10 изв. 5"'],
                               ['Шлейф: 115', '', 'Описание: "шс. 10 изв. 6"'],
                               ['Шлейф: 116', '', 'Описание: "шс. 10 изв. 7"'],
                               ['Шлейф: 117', '', 'Описание: "шс. 10 изв. 8"'],
                               ['Шлейф: 118', '', 'Описание: "шс. 10 изв. 9"'],
                               ['Шлейф: 119', '', 'Описание: "шс. 10 изв. 10"']]
        self.output = [['Выход: 1', ''],
                      ['Выход: 2', ''],
                      ['Выход: 3', ''],
                      ['Выход: 4', '']]
        self.relay = [['Реле: 1', '', '', '', '', []],
                      ['Реле: 2', '', '', '', '', []],
                      ['Реле: 3', '', '', '', '', []],
                      ['Реле: 4', '', '', '', '', []]]

        '''
            ['Реле: 3', 'a', 'b', 'c', 'd', [e]]
            a - (int)               Программа управления (тактика)
            b - (float *.*)         Задержка включения, сек
            c - (float *.*)         Время управления, сек
            d - (str)               Описание
            e - ('  Раздел: int')   Массив разделов привязанных к реле для управления
        '''

    def read_plume(self, num):
        return self.plumes[num - 1]

    def write_plume(self, num: int, chapter: int = 0, description: str = ''):

        self.plumes[num - 1][1] = f'Раздел: {str(chapter)}' if chapter > 0 else self.plumes[num - 1][1]
        self.plumes[num - 1][2] = f'Описание: "{description}"' if description != '' else self.plumes[num - 1][2]

    def read_special_plume(self, num):
        return self.special_plumes[num - 1]

    def write_special_plume(self, num: int, chapter: int, description: str):
        self.special_plumes[num - 1][1] = f'Раздел: {str(chapter)}' if chapter > 0 else self.plumes[num - 1][1]
        self.special_plumes[num - 1][2] = description if description != '' else self.plumes[num - 1][2]

    def write_relay(self, num: int,  description: str, *chapters: int):
        for c in chapters:
            self.relay[num - 1][5].append(f'Раздел: {str(c)}')
        self.output[num - 1][1] = f'Описание: "{description}"'

    def build(self):
        head = "\n  ".join([self.get_header(),
                            self.status,
                            self.reader])
        plumes = ''
        for p in self.plumes:
            p = list(filter(None, p))
            plumes += "  " + ", ".join(p)
            plumes += "\n"
        for sp in self.special_plumes:
            sp = list(filter(None, sp))
            plumes += "  " + ", ".join(sp)
            plumes += "\n"
        for o in self.output:
            o = list(filter(None, o))
            plumes += "  " + ", ".join(o)
            plumes += "\n"
        for r in self.relay:
            chs = ''
            for ch in r[5]:
                chs += f'    {ch}\n' if ch != '' else ''

            relay = list(filter(None, r[:-1]))

            plumes += f"  {', '.join(relay)}\n{chs[:-1]}" if chs != '' else f"  {', '.join(relay)}"
            plumes += "\n"

        plumes = plumes[:-1]

        return "\n".join([head, plumes])


class AnyDefVal:
    @staticmethod
    def type_devices():
        return 'Тип_прибора: 1,  Число_шлейфов: 20,  Число_реле: 0,    Базовый_тип:стандартный, Название: "Сигнал-20"\n' \
            'Тип_прибора: 2,  Число_шлейфов: 20,  Число_реле: 5,    Базовый_тип:стандартный, Название: "Сигнал-20П"\n' \
            'Тип_прибора: 3,  Число_шлейфов: 0,   Число_реле: 4,    Базовый_тип:стандартный, Название: "С2000-СП1"\n' \
            'Тип_прибора: 4,  Число_шлейфов: 4,   Число_реле: 2,    Базовый_тип:стандартный, Название: "С2000-4"\n' \
            'Тип_прибора: 7,  Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-К"\n' \
            'Тип_прибора: 8,  Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-ИТ"\n' \
            'Тип_прибора: 9,  Число_шлейфов: 127, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КДЛ"\n' \
            'Тип_прибора: 10, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-БИ/БКИ"\n' \
            'Тип_прибора: 11, Число_шлейфов: 20,  Число_реле: 5,    Базовый_тип:стандартный, Название: "Сигнал-20(вер. 02)"\n' \
            'Тип_прибора: 13, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КС"\n' \
            'Тип_прибора: 14, Число_шлейфов: 6,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-АСПТ"\n' \
            'Тип_прибора: 15, Число_шлейфов: 2,   Число_реле: 6,    Базовый_тип:стандартный, Название: "С2000-КПБ"\n' \
            'Тип_прибора: 16, Число_шлейфов: 2,   Число_реле: 2,    Базовый_тип:стандартный, Название: "С2000-2"\n' \
            'Тип_прибора: 19, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "УО-ОРИОН"\n' \
            'Тип_прибора: 20, Число_шлейфов: 4,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор"\n' \
            'Тип_прибора: 21, Число_шлейфов: 26,  Число_реле: 0,    Базовый_тип:стандартный, Название: "Рупор-Диспетчер исп.01"\n' \
            'Тип_прибора: 22, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-ПТ"\n' \
            'Тип_прибора: 24, Число_шлейфов: 4,   Число_реле: 0,    Базовый_тип:стандартный, Название: "УО-4С"\n' \
            'Тип_прибора: 25, Число_шлейфов: 47,  Число_реле: 0,    Базовый_тип:стандартный, Название: "Поток-3Н"\n' \
            'Тип_прибора: 26, Число_шлейфов: 20,  Число_реле: 5,    Базовый_тип:стандартный, Название: "Сигнал-20М"\n' \
            'Тип_прибора: 28, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-БИ-01"\n' \
            'Тип_прибора: 30, Число_шлейфов: 0,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор-01"\n' \
            'Тип_прибора: 31, Число_шлейфов: 134, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-Adem"\n' \
            'Тип_прибора: 33, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-12 исп.50, исп.51, без исполнения"\n' \
            'Тип_прибора: 34, Число_шлейфов: 110, Число_реле: 4,    Базовый_тип:стандартный, Название: "Сигнал-10"\n' \
            'Тип_прибора: 36, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-ПП"\n' \
            'Тип_прибора: 38, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-12 исп.54"\n' \
            'Тип_прибора: 39, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-24 исп.50, исп.51"\n' \
            'Тип_прибора: 41, Число_шлейфов: 127, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КДЛ-2И"\n' \
            'Тип_прибора: 43, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-PGE"\n' \
            'Тип_прибора: 44, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-БКИ"\n' \
            'Тип_прибора: 45, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "Поток-БКИ"\n' \
            'Тип_прибора: 46, Число_шлейфов: 3,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор-200"\n' \
            'Тип_прибора: 47, Число_шлейфов: 200, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-Периметр"\n' \
            'Тип_прибора: 48, Число_шлейфов: 6,   Число_реле: 0,    Базовый_тип:стандартный, Название: "МИП-12"\n' \
            'Тип_прибора: 49, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "МИП-24"\n' \
            'Тип_прибора: 53, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-48 исп.01"\n' \
            'Тип_прибора: 54, Число_шлейфов: 6,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-12 исп.56"\n' \
            'Тип_прибора: 55, Число_шлейфов: 5,   Число_реле: 0,    Базовый_тип:стандартный, Название: "РИП-24 исп.56"\n' \
            'Тип_прибора: 59, Число_шлейфов: 2,   Число_реле: 4,    Базовый_тип:стандартный, Название: "Рупор исп.02"\n' \
            'Тип_прибора: 61, Число_шлейфов: 127, Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-КДЛ-Modbus"\n' \
            'Тип_прибора: 66, Число_шлейфов: 5,   Число_реле: 5,    Базовый_тип:стандартный, Название: "Рупор исп.03"\n' \
            'Тип_прибора: 67, Число_шлейфов: 7,   Число_реле: 1,    Базовый_тип:стандартный, Название: "Рупор-300"\n' \
            'Тип_прибора: 76, Число_шлейфов: 0,   Число_реле: 0,    Базовый_тип:стандартный, Название: "С2000-PGE исп.01"\n'

    @staticmethod
    def passwords():
        return 'Номер: 1,   Тип_пароля: "Пароль"  , Пароль: 123456   , Хозорган: "Программирование"\n' \
               'Номер: 2,   Тип_пароля: "Пароль"  , Пароль: 1234     , Хозорган: "Управление шлейфами", Уровень: 255\n'
